notes/how_to_debug_adobe_air_app.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-04-04 Wed 13:44 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>如何 debug Adobe AIR 程序</title>
<meta name="generator" content="Org mode">
<meta name="author" content="md11235">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="preamble" class="status">
<p class="date">Published: </p>
</div>
<div id="content">
<h1 class="title">如何 debug Adobe AIR 程序</h1>
<ol class="org-ol">
<li>touch a empty file in the application's META-INF/AIR directory.</li>
<li>launch a "fdb" program and perform "run" in the (fdb) shell.</li>
<li>launch the target air application using adl.exe: "adl.exe MeTA-INF\AIR\application.xml ."</li>
</ol>

<p>
example:
</p>

<div class="org-src-container">
<pre class="src src-shell">$/d/flex_sdk//4.5.1/bin/fdb
Adobe fdb (Flash Player Debugger) [build 21328]
<span style="color: #00fa9a;">Copyright</span> (c) 2004-2007 Adobe, Inc. All rights reserved.
(fdb) run
Waiting for Player to connect
Player connected; session starting.
Set breakpoints and then type <span style="color: #ffa500;">'continue'</span> to resume the session.
[SWF] Bootstrapper.swf/[[DYNAMIC]]/12 - 399,550 bytes after decompression
(fdb) c
[SWF] Bootstrapper.swf/[[DYNAMIC]]/13 - 146,426 bytes after decompression
[trace] rslCompleteHandler
[trace] initDefaultConnection::main0
[UnloadSWF] unknown
Player session terminated
(fdb) quit
</pre>
</div>

<p>
or
</p>

<div class="org-src-container">
<pre class="src src-shell">C:\Program Files\Suncity Game\Snd DB&gt;d:\flex_sdk\4.5.1\bin\adl.exe META-INF\AIR\application.xml .
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: md11235 (<a href="mailto:md11235@gmail.com">md11235@gmail.com</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.50 (<a href="http://orgmode.org">Org</a> mode 9.1.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>